## Plan Result (sds_test_ado)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_polybasestaging_owner[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_polybasestaging_owner[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "04f5f4af-6e8b-4d0c-892f-6aabc8fadce7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/mi-test-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingtest"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sds_test_ado","Vars":{}} -->